
Процедура ВыполнитьJSON(Кнопка)
	
	Попытка
		Исходящий = ЗаписатьJSON(ПрочитатьJSON(Входящий, ВходящийРежим), ИсходящийРежим);
		ЭлементыФормы.Исходящий.ЦветТекстаПоля = ЦветаСтиля.ЦветТекстаПоля;
	Исключение
		Исходящий = ИнформацияОбОшибке().Описание;
		ЭлементыФормы.Исходящий.ЦветТекстаПоля = ЦветаСтиля.ЦветОсобогоТекста;
	КонецПопытки;
	
КонецПроцедуры // ВыполнитьJSON()


Процедура ВходящийРежимОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры // ВходящийРежимОчистка

Процедура ИсходящийРежимОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры // ИсходящийРежимОчистка()


Процедура ПриОткрытии()
	
	Входящий = ЭтотОбъект.ПолучитьМакет("Макет").ПолучитьТекст();
	ВходящийРежим = Неопределено;
	ИсходящийРежим = Истина;
	
	ЭлементыФормы.ВходящийРежим.СписокВыбора.Добавить(Неопределено, "Автоопределение");
	ЭлементыФормы.ВходящийРежим.СписокВыбора.Добавить(Истина, "Стандарт");
	ЭлементыФормы.ВходящийРежим.СписокВыбора.Добавить(Ложь, "Альтернативный");
	
	ЭлементыФормы.ИсходящийРежим.СписокВыбора.Добавить(Истина, "Стандарт");
	ЭлементыФормы.ИсходящийРежим.СписокВыбора.Добавить(Ложь, "Альтернативный");
	
КонецПроцедуры // ПриОткрытии()
