
&НаКлиенте
Процедура ВыполнитьJSON(Команда)
	
	ВыполнитьJSONСервер();
	
КонецПроцедуры // ВыполнитьJSON()

&НаСервере
Процедура ВыполнитьJSONСервер()
	
	Модуль = РеквизитФормыВЗначение("Объект");
	
	Попытка
		Объект.Исходящий = Модуль.ЗаписатьJSON(Модуль.ПрочитатьJSON(Объект.Входящий, Объект.ВходящийРежим), Объект.ИсходящийРежим);
		Объект.НекорректныеДанные = Ложь;
	Исключение
		Объект.Исходящий = ИнформацияОбОшибке().Описание;
		Объект.НекорректныеДанные = Истина;
	КонецПопытки;
	
КонецПроцедуры // ВыполнитьJSONСервер()


&НаКлиенте
Процедура ВходящийРежимОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры // ВходящийРежимОчистка()

&НаКлиенте
Процедура ИсходящийРежимОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры // ИсходящийРежимОчистка()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Входящий = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет").ПолучитьТекст();
	Объект.ВходящийРежим = Неопределено;
	Объект.ИсходящийРежим = Истина;
	
	Элементы.ВходящийРежим.СписокВыбора.Добавить(Неопределено, "Автоопределение");
	Элементы.ВходящийРежим.СписокВыбора.Добавить(Истина, "Стандарт");
	Элементы.ВходящийРежим.СписокВыбора.Добавить(Ложь, "Альтернативный");
	
	Элементы.ИсходящийРежим.СписокВыбора.Добавить(Истина, "Стандарт");
	Элементы.ИсходящийРежим.СписокВыбора.Добавить(Ложь, "Альтернативный");
	
КонецПроцедуры // ПриСозданииНаСервере()
